using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace get_hight
{
    internal class SpringOnion : Herb
    {
        public SpringOnion()
        {
            properties = "ต้นหอมเป็นผักที่มีรสชาติเผ็ดร้อน มีส่วนช่วยในการขับเหงื่อ ช่วยบำรุงหัวใจ ช่วยป้องกันโรคหัวใจ\nแก้แมลงสัตว์กัดต่อย ช่วยลดไข้ แก้หวัด แก้คัดจมูก แก้น้ำมูกไหล ช่วยป้องกันโรคโลหิตจาง ช่วยบำรุง\nสายตาช่วยบำรุงผิวพรรณ ช่วยลดกระดูกพรุน ช่วยป้องกันโรคมะเร็ง มีเส้นใยอาหาร ช่วยป้องกันอา\nการท้องผูกช่วยบำรุงระบบย่อยอาหาร ช่วยลดคอเลสเตอรอลในกระแสเลือด มีสารอนุมูลอิสระ มีภูมิ\nคุ้มกันเชื้อโรคอุดมไปด้วยวิตามินมีประโยชน์ต่อร่างกาย โดยเฉพาะวิตามิน A และวิตามิน K ที่มีประ\nโยชน์ต่อสุขภาพตาและผิวพรรณ นอกจากนี้ ต้นหอมยังเป็นแหล่งของวิตามิน C ซึ่งเป็นตัวช่วยประ\nสิทธิภาพในการดูแลรักษาร่างกาย";
            source = "ต้นหอม หรือในชื่อภาษาอังกฤษ Spring Onion มีแหล่งกำเนิดมาจากอยุโรป\nและเอเชียตะวันออกเฉียงใต้แต่ละพันธุ์ก็จะมีขนาดที่ต่างกันแต่ปัจจุบันได้ระบาด\nไปยังทั่วโลกแล้วสามารถปลูกได้ในพื้นที่ที่มีอากาศเย็นๆและมีความชื้นสูง ต้นหอม\nยังเป็นพืชผักสมุนไพรที่หลายคนคุ้นเคยกันดีเป็นพืชล้มลุก มีหัวใต้ดิน สีเขียว และ\nมีกลิ่นฉุนเฉพาะตัว อยู่ในพืชตระกูลเดียวกับกระเทียม ในส่วนของต้นหอมกินได้ทั้งใบ\nดอกและหัวเมื่อกินเฉยๆจะมีรสชาติเผ็ดร้อน ต้นหอมเป็นพืชสมุนไพรไทยที่มาแต่\nโบราณ มีประโยชน์สรรพคุณ ทางยาหลายอย่างนำมาประกอบอาหารเมนูได้หลายเมนู\nกินได้ทั้งสดและผ่านการปรุง";
            price = "ราคาของต้นหอมสามารถแตกต่างกันไปตามสถานที่ และฤดูกาล ในบางท้องตลาดอาจมีการขาย\nต้นหอมในราคาประมาณ 20-40 บาทต่อกิโลกรัม แต่อาจมีความแตกต่างขึ้นอยู่กับความสดใหม่ของผลผลิต\nและการขายของแต่ละร้านสามารถเปลี่ยนแปลงได้ตามสภาพตลาดและความต้องการของผู้บริโภค";
        }

        
       
    }
}
