using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace get_hight
{
    internal class KratomLeaves : Herb
    {
        public KratomLeaves()
        {
            properties = "กระท่อมเป็นพืชที่ใช้เข้าเป็นตัวยา โดยเฉพาะในยาแผนโบราณของไทย ซึ่งในทางยา\nใบกระท่อมมีสาร ไมทราไจนีน ที่ช่วยลดอาการปวดได้โดยเมื่อกินใบกระท่อม 200 มิล\nลิกรัม/น้ำหนักตัว 1 กิโลกรัม จะมีฤทธิ์ใกล้เคียงกับมอร์ฟีนขนาด 5 มิลลิกรัม/น้ำหนักตัว\n1 กิโลกรัมจึงมักจะมีการนำใบกระท่อมมาใช้เป็นทางเลือกในการบำบัดผู้ติดยาเนื่องจาก\nผลข้างเคียงที่น้อยกว่าสารเสพติดชนิดอื่นๆ และยังสามารถแก้ท้องเสีย ปวดเบ่ง ปวด\nเมื่อย ตามร่างกาย ปวดเบ่ง ปวดเมื่อย ตามร่างกาย ท้องเสีย ท้องเฟ้อสูตรยาของหมอพื้น\nบ้านมักจะใช้กระท่อมเป็นยารักษาโรคแก้ท้องร่วง ทำให้นอนหลับ และระงับประสาท\nแก้พยาธิในเด็ก ในต่างประเทศมีรายงานว่า ช่วยลดความดันโลหิต บรรเทาเบาหวาน\nแก้ไอมีบางรายงานระบุว่า ใบกระท่อมช่วยลดอาการซึมเศร้า โรควิตกกังวลอีกด้วย แต่ว่า\nเมื่อมีข้อดีก็ต้องมีข้อเสียโดยผลกระทบจากการกินใบกระท่อมจะทำให้เม็ดสีที่ผิวหนัง\nเปลี่ยนเป็นสีคล้ำ-เข้มขึ้นอาจจะเกิดตะกอนตกค้างในลำไส้ได้จากกากใบกระท่อมอาจจะมี\nอาการอาเจียน ท้องเสีย เบื่ออาหารได้หากกินติดต่อเป็นเวลานาน และในปริมาณมาก ทำให้อาจ\nเกิดภาวะทางจิตได้";
            source = "ต้นกระท่อมหรือ Mitragyna Speciosa ที่โตได้สูงถึงมากกว่า 20 เมตร ซึ่งมีถิ่นกำ\nเนิดในแทบเอเชียตะวันออกเฉียงใต้โดยประเทศผู้ผลิตชั้นนำได้แก่ อินโดนีเซีย ตามด้วย\nมาเลเซีย และประเทศไทย กระท่อมเป็นพืชธรรมชาติที่อยู่ในวงศ์เดียวกับต้นกาแฟ หลังจาก\nใบกระท่อมถูกปลดล็อกออกจากสถานะบัญชียาเสพติตให้โทษในประเภทที่ 5 ซึ่งคือการ\nอนุญาตให้ประชาชนทั่วไปสามารถปลูกและขายใบสดๆ ได้ ใบกระท่อมจึงได้รับความ\nสนใจอย่างมากไม่เพียงในประเทศไทยแต่รวมถึงประเทศอื่นๆ กระท่อมมีหลากหลายสายพันธุ์\nที่แตกแต่งกันด้วยลักษณะอย่างความหนา สีของก้านและเส้นของใบรวมถึงดอกไม้\nในประเทศไทยจะมีสี่สายพันธุ์ที่เป็นที่นิยม ซึ่งได้แก่ พันธ์เหรียญทอง แตงกวา ก้านแดง\nและแมงดา(ใบหยัก/หางกั้ง) นอกจากนี้แต่ละชนิดจะต่างกันอีกในด้านความแรงของฤทธิ์\nรสชาติ และกลิ่น นอกจากนี้ชาวบ้านอาจรับประทานพร้อมกับเกลือหรือมะนาวเ\nล็กน้อย เพราะมีความเชื่อว่าเกลืออาจจะช่วยลดการท้องผูกและมะนาวจะลดอาการเมา\nแต่ต้องรอการศึกษาและวิจัยเพื่อมารองรับ ไม่เพียงเท่านี้ใบกระท่อมสามารกนำไปตากแห้งและค่อยนำ\nมาบดละเอียดเป็นผง เพื่อชงในน้ำร้อนเหมือนชา";
            price = "สำหรับใบสดมีขายเป็นมัดและเป็นกิโลกรัมทั้งปลีกและส่ง ราคาเริ่มต้นตั้งแต่ 100-900 บาท\nมีบางร้านขายเป็นขีดเริ่มต้นที่ 60-100 บาท หรือแม้กระทั่งขายเป็นใบ ใบละ 5 บาท\nก็มีให้เห็นเช่นกัน";
        }
    }
}
