using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace get_hight
{
    internal class Marijuana : Herb
    {
        public Marijuana()
        {
            properties = "กัญชามีฤทธิ์สำคัญ2ชนิด คือ THC และ CBD ประโยชน์ของกัญชามีอะไรบ้างนั้น ได้แก่\nTHC ย่อมาจาก Tetrahydrocannabinol มีฤทธฺิ์ต่อจิตประสาท ช่วยทำให้คุณรู้สึกผ่อน\nคลาย เคลิบเคลิ้ม นอนหลับง่าย และลดอาการตึงเครียดได้CBD ย่อมาจาก Cannabidiol \nสามารถช่วยบรรเทาอาการอักเสบของแผล ลดความเจ็บปวดลง ลดอาการคลื่นไส้ ลดอา\nการชักเกร็ง อีกทั้งยังสามารถต่อต้านยับยั้งเซลล์มะเร็ง\nสรรพคุณ ของกัญชา คุณสมบัติกัญชา มีอะไรบ้าง\nช่วยให้เจริญอาหาร ช่วยผ่อนคลาย ทำให้อารมณ์ดีมากขึ้น นอนหลับง่าย ลดอาการคลื่นไส้\n อาเจียน บรรเทาอาการปวดเรื้อรัง ต่อต้านอาการซึมเศร้า ยับยั้งเซลล์มะเร็งเมื่อเรารับประ\nทานกัญชาเข้าไปแล้ว แต่ละคนอาจมีอาการตอบสนองจากกัญชาที่ไม่เหมือนกัน ซึ่งอาการ\nที่สามารถสังเกตได้แน่ชัด ดังนี้วิงเวียนศีรษะ คลื่นไส้อาเจียน ปากแห้งคอแห้ง หัวใจเต้นเร็ว\nเจ็บหน้าอก หายใจไม่ออกกระวนกระวาย อารมณ์แปรปรวน เห็นภาพหลอน วิตกกังวล";
            source = "คําว่ากัญชาเป็นคําเรียกเดิมที่มาจากภาษาอินเดีย ซึ่งชาวพื้นบ้านของอินเดีย ได้นําพืช ชนิดนี้\nไปใช้ประโยชน์อย่างแพร่หลายที่สุดทั้งการเสพติด และเป็นเส้นใยมาตั้งแต่ดึกดําบรรพ์ แล้ว\nจากนั้นจึงมีผู้นํามา กระจายพันธุ์ยังภูมิภาคเอเชียตะวันออกเฉียงใต้จนถึงอินโดนีเซีย หมู่เกาะ\nในมหาสมุทรแปซิฟิก และประเทศในย่านเขต ร้อนและเขตอบอุ่นของโลก ทั่วไปอย่างแพร่\nหลายและกว้างขวางหลายในปี 960-1279 ก่อนคริสตศักราชได้มีบันทึกว่าในประเทศจีนมีการ\nปลูกกัญชงเพื่อเป็นพืชใช้ทําเส้นใยและในสมัยโรมราณ ได้มีการนําพืชชนิดนี้จากทวีปเอเชีย\nเข้าไปปลูกในประเทศอิตาลี แล้วจากนั้นจึงแพร่หลายทั่วไปในทวีปยุโรปและทั่วโลก";
            price = "ใบสดกัญชา ถูกสุดอยู่ที่ 2,000 บาท/กก. ใบแห้งกัญชา ประมาณ 10,000 บาท/กก.\nกิ่ง,ก้านกัญชา ประมาณ1,000 – 2,000 บาท/กก. รากกัญชา หลักหมื่น / กก.";

        }
    }
}
